SuhasMruthunjaya/SuhasMruthunjaya/HDA_Lec_Slides/Safety/070_SensorDiagnostics_FSM_code/30_PSOC2_SingleChannel_RTE.cydsn/Generated_Source/PSoC5/ENGINE_Direction.h
/*******************************************************************************
* File Name: ENGINE_Direction.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_ENGINE_Direction_H) /* CY_CONTROL_REG_ENGINE_Direction_H */
#define CY_CONTROL_REG_ENGINE_Direction_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} ENGINE_Direction_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    ENGINE_Direction_Write(uint8 control) ;
uint8   ENGINE_Direction_Read(void) ;

void ENGINE_Direction_SaveConfig(void) ;
void ENGINE_Direction_RestoreConfig(void) ;
void ENGINE_Direction_Sleep(void) ; 
void ENGINE_Direction_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define ENGINE_Direction_Control        (* (reg8 *) ENGINE_Direction_Sync_ctrl_reg__CONTROL_REG )
#define ENGINE_Direction_Control_PTR    (  (reg8 *) ENGINE_Direction_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_ENGINE_Direction_H */


/* [] END OF FILE */
